{
    "songs": [
        {
            "title": "Rap God",
            "artist": "Eminem",
            "artist_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Eminem_2021_Color_Corrected.jpg",
            "lyrics": "Look, I was gonna go easy on you not to hurt your feelings\nBut I'm only going to get this one chance (Six minutes—, six minutes—)\nSomething's wrong, I can feel it (Six minutes, Slim Shady, you're on!)\nJust a feeling I've got, like something's about to happen, but I don't know what.\nIf that means what I think it means, we're in trouble, big trouble;\nAnd if he is as bananas as you say, I'm not taking any chances\nYou are just what the doc ordered\nI'm beginnin' to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nNow, who thinks their arms are long enough to slap box, slap box?\nThey said I rap like a robot, so call me Rap-bot\nBut for me to rap like a computer it must be in my genes\nI got a laptop in my back pocket\nMy pen'll go off when I half-cock it\nGot a fat knot from that rap profit\nMade a livin' and a killin' off it\nEver since Bill Clinton was still in office\nWith Monica Lewinsky feelin' on his nutsack\nI'm an MC still as honest\nBut as rude and as indecent as all hell\nSyllables, skill-a-holic (Kill 'em all with)\nThis flippity dippity-hippity hip-hop\nYou don't really wanna get into a pissin' match\nWith this rappity brat, packin' a MAC in the back of the Ac'\nBackpack rap crap, yap-yap, yackety-yack\nAnd at the exact same time, I attempt these lyrical acrobat stunts while I'm practicin' that\nI'll still be able to break a motherfuckin' table\nOver the back of a couple of faggots and crack it in half\nOnly realized it was ironic, I was signed to Aftermath after the fact\nHow could I not blow? All I do is drop F-bombs\nFeel my wrath of attack\nRappers are havin' a rough time period, here's a maxi pad\nIt's actually disastrously bad for the wack\nWhile I'm masterfully constructing this masterpièce\nCause I'm beginnin' to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nNow, who thinks their arms are long enough to slap box, slap box?\nLet me show you maintainin' this shit ain't that hard, that hard\nEverybody want the key and the secret to rap immortality like Ι have got\n",
            "image_url": "https://t2.genius.com/unsafe/680x680/https%3A%2F%2Fimages.genius.com%2F058e2359838c93395c36119b48a2eff6.1000x1000x1.png",
            "released_year": 2013,
            "musical_style": "rap"
        },
        {
            "title": "Pars avec moi",
            "artist": "Nekfeu",
            "artist_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Nekfeu_avp.jpg/440px-Nekfeu_avp.jpg",
            "lyrics": "Peut-être que l'on évolue plus depuis les sumériens\nPeut-être que l'on est trop lugubres, on a vu qu'on assumait rien\nPeut-être que l'époque veut ça, je n'ai que des pensées confuses\nVu qu'on nous juge aux pes-sa, vu qu'on dépense et qu'on fume\n",
            "image_url": "https://t2.genius.com/unsafe/680x680/https%3A%2F%2Fimages.genius.com%2F11d934ebfbe4d2958a58a7ba2c71b4a0.600x600x1.jpg",
            "released_year": 2015,
            "musical_style": "rap"
        },
        {
            "title": "Houdini",
            "artist": "Dua Lipa",
            "artist_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/DuaLipaO2020522_%28101_of_110%29_%2852052470251%29_%28cropped%29.jpg/440px-DuaLipaO2020522_%28101_of_110%29_%2852052470251%29_%28cropped%29.jpg",
            "lyrics": "I come and I go\nTell me all the ways you need me\nI'm not here for long\nCatch me or I go Houdini\nI come and I go\nProve you got the right to please me\nEverybody knows\nCatch me or I go Houdini\n",
            "image_url": "https://t2.genius.com/unsafe/680x680/https%3A%2F%2Fimages.genius.com%2F703b74c35a76f0ed763a6e50e73fb4fd.1000x1000x1.png",
            "released_year": 2023,
            "musical_style": "pop"
        }
    ]
}